import { Headline } from '@/components/Headline'
import { SectionPage } from '@/components/SectionPage'

export default function Page() {
  return (
    <SectionPage>
      <Headline className="mb-12 max-lg:mb-8 max-md:mb-6" title="Пользовательское соглашение" />
      <div className="mx-auto prose lg:prose-xl">
        <p>
          <b>1. Общие положения</b>
        </p>
        <p>
          1.1. Пользовательское соглашение (далее - «Соглашение») является публичной офертой и
          определяет условия использования материалов и сервисов, размещенных Администратором на
          сайте в сети интернет по адресу divermaster.ru (далее - «Сайт») пользователями при помощи
          Сервиса.
        </p>
        <p>
          1.2. Сервис - это программно-аппаратный комплекс, доступный на Сайте, позволяющий
          Пользователю использовать предусмотренный для него функционал. Сервис включает в себя
          интерфейс, программное обеспечение и иные элементы (инструменты, алгоритмы, способы),
          необходимые для надлежащего функционирования Сайта.
        </p>
        <p>
          1.3. Администратором является ИП Назаревич Галина Вячеславовна зарегистрированный в
          реестре индивидуальных предпринимателей под № 306312819500059
        </p>
        <p>(далее - «Администратор»).</p>
        <p>
          1.4. Пользователь - любое физическое лицо и/или юридическое лицо, в том числе посетитель
          Сайта, принимающий условия Соглашения.
        </p>
        <p>
          1.5. Соглашение является публичной офертой в соответствии со статьей 435 и пунктом 2
          статьи 437 Гражданского кодекса Российской Федерации.
        </p>
        <p>
          1.6. Соглашение, заключаемое путем акцепта настоящей оферты, не требует двустороннего
          подписания и действительно в электронном виде.
        </p>
        <p>
          1.7. Начиная использовать Сайт и/или его отдельные функции, Пользователь считается
          принявшим условия Соглашения в полном объеме, без всяких оговорок и исключений.
        </p>
        <p>
          1.8. В случае несогласия с Соглашением Пользователь обязан немедленно прекратить
          использование Сайта и покинуть его.
        </p>
        <p>
          <b>2. Обязательства пользователя</b>
        </p>
        <p>
          2.1. Любое использование материалов Сайта, включая, но не ограничиваясь, копирование,
          воспроизведение, переработка материалов, использованных на Сайте, не допускается, за
          исключением цитирования материалов в объеме объективно необходимом для целей цитирования
          Пользователем материалов.
        </p>
        <p>
          2.2. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка
          на Сайт обязательна.
        </p>
        <p>
          <b>3. Ответственность администратора</b>
        </p>
        <p>
          3.1. Администратор не несет ответственности за посещение и использование Пользователем
          внешних ресурсов, ссылки на которые могут содержаться на Сайте.
        </p>
        <p>
          3.2. Администратор не несет ответственности и не имеет прямых или косвенных обязательств
          перед Пользователем в связи с любыми возможными или возникшими потерями или убытками,
          связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой
          регистрации, товарами или услугами, доступными на или полученными через внешние сайты или
          ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на
          Сайте информацию или ссылки на внешние ресурсы.
        </p>
        <p>
          3.3. Пользователь согласен с тем, что Администратор не несет какой-либо ответственности и
          не имеет каких-либо обязательств в связи с рекламой, которая может быть размещена на Сайте
          Администратором или третьими лицами, в том числе автоматизированными системами показа
          рекламы (объявлений), установленными на Сайте.
        </p>
        <p>
          <b>4. Изменение условий соглашения</b>
        </p>
        <p>
          4.1. Администратор вправе в любое время в одностороннем порядке изменять условия
          Соглашения. Такие изменения вступают в силу по истечении 30 дней с момента размещения
          новой версии Соглашения на Сайте.
        </p>
        <p>
          4.2. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа
          к Сайту. Прекратить использование материалов и сервисов Сайта.
        </p>
        <p>
          4.3. Продолжая использовать Сайт, Пользователь подтверждает свое безоговорочное согласие с
          новой версией Соглашения.
        </p>
        <p>
          <b>5. Заключительные положения</b>
        </p>
        <p>
          5.1. Все возможные споры, вытекающие из Соглашения или связанные с ним, подлежат
          разрешению в соответствии с действующим законодательством Российской Федерации.
        </p>
        <p>Администратор ИП Назаревич Галина Вячеславовна</p>
        <p>Адрес Воронежская область, Новоусманский район, Усманский 1-й, с Новая Усмань</p>
        <p>ОГРНИП 306312819500059</p>
        <p>ИНН 312815498770</p>
        <p>Банк ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК г Воронеж</p>
        <p>БИК 042007681</p>
        <p>кор/счет 30101810600000000681</p>
        <p>Расчётный счёт 40802810913000055940</p>
        <p>Администратор.</p>
        <p>ИП Назаревич Галина Вячеславовна</p>
      </div>
    </SectionPage>
  )
}
